run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libfunctionObjectsST.so")

applicationClass    channelBubbleSurfaceTrackFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          2.5e-6;

writeControl    adjustableRunTime;//runTime; //timeStep;//

writeInterval   1e-4;//50;//

cycleWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1e-5;
minDeltaT       1e-7;

/*OptimisationSwitches*/
/*{*/
/*    quadricsFit 1;*/
/*}*/

functions
{
    interfaceForces
    {
        type           interfaceForces;
        historyPatch   interface;
        log            yes;
    }

/*    bubbleHistory*/
/*    {*/
/*        type bubbleHistory;*/
/*        functionObjectLibs*/
/*        (*/
/*            "libfunctionObjectsST.so"*/
/*        );*/
/*    }*/
}


// ************************************************************************* //
