run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/constant/faMesh/faBoundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       faBoundaryMesh;
    location    "constant/faMesh";
    object      faBoundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    upperWedge
    {
        type            wedge;
        edgeLabels      List<label> 
80
(
80
82
84
86
88
90
92
94
96
98
100
102
104
106
109
111
114
116
118
120
122
124
126
128
130
132
134
136
138
140
142
144
146
148
150
152
154
156
158
160
162
164
166
168
170
172
174
176
178
180
182
184
186
188
190
192
194
196
198
200
202
204
206
208
210
212
214
216
218
220
222
224
226
228
230
232
234
236
238
240
)
;
        ngbPolyPatchIndex 3;
    }
    lowerWedge
    {
        type            wedge;
        edgeLabels      List<label> 
80
(
79
81
83
85
87
89
91
93
95
97
99
101
103
105
107
110
113
115
117
119
121
123
125
127
129
131
133
135
137
139
141
143
145
147
149
151
153
155
157
159
161
163
165
167
169
171
173
175
177
179
181
183
185
187
189
191
193
195
197
199
201
203
205
207
209
211
213
215
217
219
221
223
225
227
229
231
233
235
237
239
)
;
        ngbPolyPatchIndex 2;
    }
    centerline
    {
        type            symmetryPlane;
        edgeLabels      List<label> 2(108 112);
        ngbPolyPatchIndex 4;
    }
)

// ************************************************************************* //
