run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1e-06 0);

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform (0 0 0);
}
    space
    {
        type            inletOutlet;
        inletValue      uniform (0 1e-06 0);
        value           uniform (0 1e-06 0);
    }
    interface
    {
        type                    interfaceCoupledVelocityFlux;
        secondOrder             yes;
        nonOrthCorr             yes;
        neighbourRegionName     meshB;
        neighbourPatchName      interfaceShadow;
        neighbourFieldName      U;
        k                       "muFluidA";
        value                   uniform (0 0 0);
    }
    centerline
    {
        type            symmetryPlane;
    }
    upperWedge
    {
        type            wedge;
    }
    lowerWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
