run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/0/P
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      P;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    space
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    interface
    {
        type            zeroGradient;
    }
    centerline
    {
        type            symmetryPlane;
    }
    upperWedge
    {
        type            wedge;
    }
    lowerWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
